{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["reshape_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv1_pad", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "strides": [2, 2], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv1_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_pad_1", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_1", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_1", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_1_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D", "config": {"name": "conv_pw_1", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_1_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_2", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_2", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_2_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D", "config": {"name": "conv_pw_2", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_2_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_pad_3", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_3", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_3", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_3_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D", "config": {"name": "conv_pw_3", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_3_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_4", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_4", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_4_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D", "config": {"name": "conv_pw_4", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_4_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_pad_5", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_5", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_5", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_5_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D", "config": {"name": "conv_pw_5", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_5_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_6", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_6", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_6_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D", "config": {"name": "conv_pw_6", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_6_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_pad_7", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_7", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_7", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_7_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D", "config": {"name": "conv_pw_7", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_7_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_pad_8", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_8", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_8", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_8_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D", "config": {"name": "conv_pw_8", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_8_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_pad_9", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_9", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_9", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_9_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D", "config": {"name": "conv_pw_9", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_9_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_pad_10", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_10", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_10", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_10_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D", "config": {"name": "conv_pw_10", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_10_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_pad_11", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_11", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_11", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_11_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "class_name": "Conv2D", "config": {"name": "conv_pw_11", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_11_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_12", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_12", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_12_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "class_name": "Conv2D", "config": {"name": "conv_pw_12", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_12_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_pad_13", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_13", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_13", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": false, "activation": "linear", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_dw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_dw_13_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "class_name": "Conv2D", "config": {"name": "conv_pw_13", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "use_bias": false, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "name": "conv_pw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_13_relu", "activation": "relu6"}}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [1, 1, 1024], "trainable": true, "name": "reshape_1"}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout", "config": {"rate": 0.001, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout"}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "conv_preds", "class_name": "Conv2D", "config": {"name": "conv_preds", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1000, "use_bias": true, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "padding": "same", "strides": [1, 1], "kernel_regularizer": null}}, {"inbound_nodes": [[["conv_preds", 0, 0, {}]]], "name": "act_softmax", "class_name": "Activation", "config": {"trainable": true, "name": "act_softmax", "activation": "softmax"}}, {"inbound_nodes": [[["act_softmax", 0, 0, {}]]], "name": "reshape_2", "class_name": "Reshape", "config": {"target_shape": [1000], "trainable": true, "name": "reshape_2"}}], "input_layers": [["input_1", 0, 0]], "name": "mobilenet_1.00_224"}}